In [1]:
# Dependencies
from matplotlib import pyplot as plt
from scipy.stats import linregress
import scipy.stats as st
import numpy as np
import pandas as pd
import seaborn as sns
import statsmodels.api as sm
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score

In [2]:
# 1. all_ng
# https://www.eia.gov/naturalgas/ngqs/#?report=RP2&year1=2009&year2=2012&sortby
# =ICA&company=Name&items=0110VL,0120VL,0210VL,0220VL,0230VL,0300VL,0400VL,0500VL,0600VL,0700VL,0800VL

In [3]:
df1 = pd.read_excel("NG_PRI_SUM_DCU_NUS_M.xls")

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  0 non-null      float64
 1   Unnamed: 1  11 non-null     object
 2   Unnamed: 2  9 non-null      object
 3   Unnamed: 3  2 non-null      object
 4   Unnamed: 4  2 non-null      object
 5   Unnamed: 5  3 non-null      object
 6   Unnamed: 6  1 non-null      object
dtypes: float64(1), object(6)
memory usage: 968.0+ bytes

In [5]:
df1.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,Workbook Contents,NaN,NaN,NaN,NaN,NaN
1,NaN,U.S. Natural Gas Prices,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,Click worksheet name or tab at bottom for data,NaN,NaN,NaN,NaN,NaN
4,NaN,Worksheet Name,Description,# Of Series,Frequency,Latest Data for,NaN

In [6]:
file = "Henry_Hub_Natural_Gas_Spot_Price.csv"

In [7]:
df2 = pd.read_csv(file)

In [8]:
df2.describe()

              6.6
count  303.000000
mean     4.176205
std      2.136085
min      1.630000
25%      2.660000
50%      3.570000
75%      5.235000
max     13.420000

In [9]:
df2.shape

(303, 2)

In [10]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Apr-22  303 non-null    object
 1   6.6     303 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.9+ KB

In [11]:
df2.head()

   Apr-22   6.6
0  Mar-22  4.90
1  Feb-22  4.69
2  Jan-22  4.38
3  Dec-21  3.76
4  Nov-21  5.05

##